app/views/articles/_article.html.erb

SELECT  1 AS one FROM "article_categories" WHERE "article_categories"."article_id" = ? LIMIT ?  [["article_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "articles"
---
        </div>
        <% if article.article_categories.any? %>