app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(page: params[:page], per_page: 5)

INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest", "username") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 3], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 3]]
---
  def show
    @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)